; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v4)
		(pred_6 ?v2)
		(pred_3 ?v6)
		(pred_4 ?v6)
		(pred_2 ?v2 ?v6)
		(pred_5)
		(pred_1 ?v2))

   (:action op_1
       :parameters  (?v3 ?v1)
       :precondition (and (not-eq ?v3 ?v1) 
                          (pred_3 ?v3) (pred_3 ?v1) (pred_4 ?v3))
       :effect (and  (pred_4 ?v1)
		     (not (pred_4 ?v3))))


   (:action op_3
       :parameters (?v5 ?v7)
       :precondition  (and  (pred_6 ?v5) (pred_3 ?v7)
			    (pred_2 ?v5 ?v7) (pred_4 ?v7) (pred_5))
       :effect (and (pred_1 ?v5)
		    (not (pred_2 ?v5 ?v7)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v5  ?v7)
       :precondition  (and  (pred_6 ?v5) (pred_3 ?v7)
			    (pred_1 ?v5) (pred_4 ?v7))
       :effect (and (pred_2 ?v5 ?v7)
		    (pred_5)
		    (not (pred_1 ?v5)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_05 obj_04 obj_03 obj_07 obj_02 
          obj_01 obj_08 obj_06 
)
(:init
(pred_3 obj_05)
(pred_3 obj_04)
(pred_3 obj_03)
(pred_3 obj_07)
(pred_3 obj_02)
(pred_6 obj_01)
(pred_6 obj_08)
(pred_6 obj_06)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(pred_5)
(pred_2 obj_01 obj_04)
(pred_2 obj_08 obj_02)
(pred_2 obj_06 obj_07)
(pred_4 obj_07)
)
(:goal
(and
(pred_2 obj_01 obj_04)
(pred_2 obj_08 obj_05)
(pred_2 obj_06 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_08 obj_05) (pred_4 obj_04))
    (sometime-before  (pred_2 obj_06 obj_05) (pred_4 obj_04))
  )
)
)

; plan
1. (op_3 obj_06 obj_07)
   deleted: (pred_2 obj_06 obj_07) (pred_5)
   added: (pred_1 obj_06)
   goals met: 1 of 3
2. (op_1 obj_07 obj_04)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_04)
   goals met: 1 of 3
3. (op_2 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_2 obj_06 obj_04) (pred_5)
   goals met: 1 of 3
4. (op_1 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_02)
   goals met: 1 of 3
5. (op_3 obj_08 obj_02)
   deleted: (pred_2 obj_08 obj_02) (pred_5)
   added: (pred_1 obj_08)
   goals met: 1 of 3
6. (op_1 obj_02 obj_05)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_05)
   goals met: 1 of 3
7. (op_2 obj_08 obj_05)
   deleted: (pred_1 obj_08)
   added: (pred_2 obj_08 obj_05) (pred_5)
   goals met: 2 of 3
8. (op_1 obj_05 obj_04)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_04)
   goals met: 2 of 3
9. (op_3 obj_06 obj_04)
   deleted: (pred_2 obj_06 obj_04) (pred_5)
   added: (pred_1 obj_06)
   goals met: 2 of 3
10. (op_1 obj_04 obj_05)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_05)
   goals met: 2 of 3
11. (op_2 obj_06 obj_05)
   deleted: (pred_1 obj_06)
   added: (pred_2 obj_06 obj_05) (pred_5)
   goals met: 3 of 3
